; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	infrared2 - mode
	image1 - mode
	thermograph0 - mode
	infrared5 - mode
	thermograph3 - mode
	image6 - mode
	spectrograph4 - mode
	GroundStation0 - direction
	Star1 - direction
	Star2 - direction
	Star3 - direction
	GroundStation4 - direction
	Star8 - direction
	Star7 - direction
	Star5 - direction
	GroundStation6 - direction
	Star9 - direction
	Star10 - direction
	Planet11 - direction
	Planet12 - direction
)
(:init
	(supports instrument0 infrared2)
	(supports instrument0 image6)
	(supports instrument0 spectrograph4)
	(supports instrument0 thermograph3)
	(supports instrument0 infrared5)
	(supports instrument0 thermograph0)
	(supports instrument0 image1)
	(calibration_target instrument0 GroundStation6)
	(calibration_target instrument0 Star5)
	(calibration_target instrument0 Star7)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star2)
)
(:goal (and
	(pointing satellite0 GroundStation6)
	(have_image Star9 spectrograph4)
	(have_image Star10 thermograph3)
	(have_image Planet11 thermograph0)
	(have_image Planet12 thermograph0)
))

)

; plan
1. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 5
2. (turn_to satellite0 groundstation6 star2)
   deleted: (pointing satellite0 star2)
   added: (pointing satellite0 groundstation6)
   goals met: 1 of 5
3. (calibrate satellite0 instrument0 groundstation6)
   added: (calibrated instrument0)
   goals met: 1 of 5
4. (turn_to satellite0 planet11 groundstation6)
   deleted: (pointing satellite0 groundstation6)
   added: (pointing satellite0 planet11)
   goals met: 0 of 5
5. (take_image satellite0 planet11 instrument0 thermograph0)
   added: (have_image planet11 thermograph0)
   goals met: 1 of 5
6. (turn_to satellite0 groundstation6 planet11)
   deleted: (pointing satellite0 planet11)
   added: (pointing satellite0 groundstation6)
   goals met: 2 of 5
7. (turn_to satellite0 planet12 groundstation6)
   deleted: (pointing satellite0 groundstation6)
   added: (pointing satellite0 planet12)
   goals met: 1 of 5
8. (take_image satellite0 planet12 instrument0 thermograph0)
   added: (have_image planet12 thermograph0)
   goals met: 2 of 5
9. (turn_to satellite0 groundstation6 planet12)
   deleted: (pointing satellite0 planet12)
   added: (pointing satellite0 groundstation6)
   goals met: 3 of 5
10. (turn_to satellite0 star10 groundstation6)
   deleted: (pointing satellite0 groundstation6)
   added: (pointing satellite0 star10)
   goals met: 2 of 5
11. (take_image satellite0 star10 instrument0 thermograph3)
   added: (have_image star10 thermograph3)
   goals met: 3 of 5
12. (turn_to satellite0 groundstation6 star10)
   deleted: (pointing satellite0 star10)
   added: (pointing satellite0 groundstation6)
   goals met: 4 of 5
13. (turn_to satellite0 star9 groundstation6)
   deleted: (pointing satellite0 groundstation6)
   added: (pointing satellite0 star9)
   goals met: 3 of 5
14. (take_image satellite0 star9 instrument0 spectrograph4)
   added: (have_image star9 spectrograph4)
   goals met: 4 of 5
15. (turn_to satellite0 groundstation6 star9)
   deleted: (pointing satellite0 star9)
   added: (pointing satellite0 groundstation6)
   goals met: 5 of 5
